app/views/bids/index.html.erb

    <% @bids.each do |bid| %>
        <li class="list-group-item"><%= link_to "#{Item.find(bid.item_id).name} - $#{number_to_currency bid.bid_amount}",
        bid_path(bid)
---
SELECT "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]