app/views/items/index.erb

            <div class="card-deck card" style="width: 18rem;">
                <a href=<%=item_path(item.id)%>><img src=<%= item.image.present? ? item.image : Item.default_pic %> class="card-img-top" alt="..."></a>
---
SELECT "items".* FROM "items"