app/views/items/show.erb


<% if @item.tags.any? %>
    <h2>Tags</h2>
    <% @item.tags.each do |tag| %>
---
SELECT "tags".* FROM "tags" INNER JOIN "item_tags" ON "tags"."id" = "item_tags"."tag_id" WHERE "item_tags"."item_id" = ?  [["item_id", 62]]
SELECT 1 AS one FROM "tags" INNER JOIN "item_tags" ON "tags"."id" = "item_tags"."tag_id" WHERE "item_tags"."item_id" = ? LIMIT ?  [["item_id", 3], ["LIMIT", 1]]
SELECT "tags".* FROM "tags" INNER JOIN "item_tags" ON "tags"."id" = "item_tags"."tag_id" WHERE "item_tags"."item_id" = ?  [["item_id", 128]]