app/views/items/show.erb

SELECT "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "Klimt"], ["LIMIT", 1]]
---
        <%=comment.message%>
        by: <%=link_to User.find(comment.user_id).username, user_path(User.find(comment.user_id))%></div>