app/controllers/application_controller.rb

    def current_user
        if session[:username].present?
            return User.find_by(username: session[:username])
---
SELECT "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "Klimt"], ["LIMIT", 1]]