app/controllers/bids_controller.rb

  def index
    @bids = Bid.where user_id: current_user.id
---
SELECT "bids".* FROM "bids" WHERE "bids"."user_id" = ?  [["user_id", 2]]

  def show
    @bid = Bid.find(params[:id])
    @item = Item.find @bid.item_id
---
SELECT "bids".* FROM "bids" WHERE "bids"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
SELECT "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 75], ["LIMIT", 1]]

  def new
    @bid = Bid.new
    @item = Item.find(params[:item_id])
---
SELECT "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]

  def create
    @bid = Bid.new(bid_params)
    @item = Item.find(@bid.item_id)
    if @bid.save
---
SELECT "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 75], ["LIMIT", 1]]
INSERT INTO "bids" ("user_id", "item_id", "bid_amount", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 45], ["item_id", 75], ["bid_amount", 12.0], ["created_at", "2020-11-09 22:34:56.437606"], ["updated_at", "2020-11-09 22:34:56.437606"]]