app/controllers/items_controller.rb

INSERT INTO "items" ("name", "description", "seller_id", "asking_price", "end_date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
    def create
        @item = Item.new(item_params)
        if @item.save

SELECT "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 68], ["LIMIT", 1]]
---
    def update
        @item = Item.find(params[:id])