app/controllers/items_controller.rb

SELECT "items".* FROM "items" INNER JOIN "item_tags" ON "item_tags"."item_id" = "items"."id" INNER JOIN "tags" ON "tags"."id" = "item_tags"."tag_id" WHERE "tags"."name" = ?  [["name", "science"]]
SELECT "items".* FROM "items" WHERE "items"."seller_id" != ?  [["seller_id", 2]]
---
    def index
        if params[:tag_sort].present?
            @items = Item.joins(:tags).where(tags: {name: params[:tag_sort]})
        else
            case params[:list]
            when "sale"
                @items = Item.where.not seller_id: current_user.id

INSERT INTO "item_tags" ("tag_id", "item_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["tag_id", 3], ["item_id", 128], ["created_at", "2020-11-10 01:47:41.697625"], ["updated_at", "2020-11-10 01:47:41.697625"]]
INSERT INTO "items" ("name", "description", "seller_id", "asking_price", "end_date", "created_at", "updated_at", "image") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
INSERT INTO "tags" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "science"], ["created_at", "2020-11-10 01:47:41.691065"], ["updated_at", "2020-11-10 01:47:41.691065"]]
SELECT "tags".* FROM "tags" WHERE "tags"."name" = ? LIMIT ?  [["name", "wacky"], ["LIMIT", 1]]
INSERT INTO "item_tags" ("tag_id", "item_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["tag_id", 21], ["item_id", 133], ["created_at", "2020-11-10 17:42:08.370846"], ["updated_at", "2020-11-10 17:42:08.370846"]]
INSERT INTO "tags" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "wacky"], ["created_at", "2020-11-10 17:42:08.265316"], ["updated_at", "2020-11-10 17:42:08.265316"]]
UPDATE "items" SET "image" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["image", "https://encrypted-tbn0.gstatic.com/images?q=tbn%3AANd9GcS4X4O8Hhl1hCDJWioT8T-LpsEMzdxZm_eNiA&usqp=CAU"], ["updated_at", "2020-11-09 17:51:01.819057"], ["id", 70]]
---
    def create
        # byebug
        @item = Item.new(item_params)
        item_params[:tags_attributes].each do |key, value|
            @item.tags << Tag.find_or_initialize_by(name: value["name"])
        end
        if @item.save

INSERT INTO "tags" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "wacky"], ["created_at", "2020-11-10 17:44:19.939773"], ["updated_at", "2020-11-10 17:44:19.939773"]]
INSERT INTO "item_tags" ("tag_id", "item_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["tag_id", 21], ["item_id", 133], ["created_at", "2020-11-10 17:44:18.897002"], ["updated_at", "2020-11-10 17:44:18.897002"]]
UPDATE "items" SET "image" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["image", "https://encrypted-tbn0.gstatic.com/images?q=tbn%3AANd9GcS4X4O8Hhl1hCDJWioT8T-LpsEMzdxZm_eNiA&usqp=CAU"], ["updated_at", "2020-11-09 17:51:01.819057"], ["id", 70]]
---
    def update
        item_params[:tags_attributes].each do |tag|
            @item.tags << Tag.find_or_initialize_by(item_params[:tag_attributes])
        end
        if @item.update(item_params)

DELETE FROM "items" WHERE "items"."id" = ?  [["id", 131]]
---
    def destroy
        @item.delete