app/controllers/users_controller.rb

    def create
        @user = User.new(user_params)
        if @user.save
---
INSERT INTO "users" ("username", "balance", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["username", "bmoor"], ["balance", 0.0], ["created_at", "2020-11-06 18:03:26.552754"], ["updated_at", "2020-11-06 18:03:26.552754"]]

    def destroy
        @user.delete
---
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 27]]

    def update_balance
        @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 23], ["LIMIT", 1]]

    def set_user
        @user = User.find(current_user.id)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 27], ["LIMIT", 1]]