app/models/user.rb

INSERT INTO "items" ("name", "description", "seller_id", "asking_price", "end_date", "created_at", "updated_at", "image") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
    def add_item(name, desc, price, date, image)
        Item.create(seller_id: self.id, name: name, description: desc, asking_price: price,
        end_date: date, image: image)